/**************************************************************************
    BuguRTOS-0.4.x(Bugurt real time operating system)
    Copyright (C) 2011  anonimous

    This program is free software: you can redistribute it and/or modify
    it under the terms of the GNU General Public License as published by
    the Free Software Foundation, either version 3 of the License, or
    (at your option) any later version.

    This program is distributed in the hope that it will be useful,
    but WITHOUT ANY WARRANTY; without even the implied warranty of
    MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
    GNU General Public License for more details.

    You should have received a copy of the GNU General Public License
    along with this program.  If not, see <http://www.gnu.org/licenses/>.

    Please contact with me by E-mail: shkolnick.kun@gmail.com

    A special exception to the GPL can be applied should you wish to distribute
    a combined work that includes BuguRTOS, without being obliged to provide
    the source code for any proprietary components. See the file exception.txt
    for full details of how and when the exception can be applied.
**************************************************************************/

/*****************************************************************************************
```````````````````````````````..:+oyhdmNNMMMMMMNmmdhyo+:..```````````````````````````````
``````````````````````````.:oydNMMMMMMMMMNNNNNNNNMMMMMMMMMNdy+:.``````````````````````````
```````````````````````:sdNMMMMMNdys+/::----------::/osydNMMMMMNds:```````````````````````
```````````````````.+hNMMMMmho/-..........................-/shmMMMMNh/.```````````````````
````````````````./hNMMMNho:...................................-:ohNMMMNh/`````````````````
``````````````.smMMMNy/-.......:////ss++/+-.......................-+yNMMMmo.``````````````
````````````-sNMMMd+-.....:////:-...-/s::..............+o/-..........-odMMMNs.````````````
``````````.sNMMNh/....................................-o:--............./hMMMNo.``````````
`````````+mMMMh:-........................................-...............-/dMMMm/`````````
```````.yMMMm/...................-::--..................:-........--........+mMMMy.```````
``````:mMMMy-.......................-::-...............-:.........-::........-yMMMd:``````
`````/NMMN+-..................::-.....-:-............../--.........-:/-.......-+NMMN:`````
````+NMMm::o/-..--/+o+o+++++o+osys+//::-::.............:/....-:-::-..-++-.......:NMMN/````
```/NMMm:.-++-+yhs/-``       `dMMMMMmho+:-..............:-/+yho/:/+oyo//o-......./mMMN:```
``-NMMm/....-/--::/o+o+oo+oo++oosyss+smyo/.............:yyho-`     smMMddh-......./NMMN.``
`.hMMM/......-++:-.-:oooooooooosyyhhys/...............-+osyyyyysssssooo+ohhs-......+MMMh.`
`+MMMy.......-::/++:-.....-:/++++o+o/--................--/oooo+o++o+++////-y/.......hMMM/`
.mMMN:.........--:---...-::/+//::--.......................--//+//-...-.....+/......./NMMd`
/MMMy............-::----------....----/+-.....................-++/:---....-o-........hMMN:
yMMM/.............--:://///oo+++/+++oo+-.......................-://+/:--::::.........+MMMs
mMMN:................----:/h:::/:/::---.........................--/osss+++:..........:NMMd
MMMd-....................:mNs:-....................................--:odo:-..........:mMMN
MMMd-....................yoshyoso:--................................../mm/...........:mMMM
MMMm:..................../-o/h.y-:+dooo+/:--....................-/osydddmh...........:mMMN
mMMN:........................+mNs `h.  -d/:/+h++ooooy+++s++y+++mo+y` yh.do...........:NMMh
sMMM+........................-hmMo/ds  oMo`.-o     :h   s:`h` `Nysd.-Ny-h:...........+MMMo
/MMMh........................./smMMMMd+NMMNNMh`    sN: .mNNMddNMMMMNmN+..............hMMN:
.dMMN/........................./+hMMMMMMMMMMMMmhyyyNMNNMMMMMMMMMMMNsoo-............./NMMd`
`+MMMh.........................-/+omMMMMMMMMMMMMMMMMMMMMMMMMMMMMms-/+...............hMMM/`
`.hMMM+..........................:/-omMMMMMMMMMMMMMMMdmMdhMMMds/-..-...............oMMMy``
``.NMMN/............................--/hNN/h.`ys:dmsd:-syos+--+.................../NMMN.``
```/NMMm:...........................:+/--:+s++oo+osoo+/:-..-/+::-................/mMMN:```
````/NMMN:............................-/++/:-..........-//+/-..:+.--............/NMMN/````
`````:NMMN+-.............../+-.............-://////////:-.......+s+::.........-oNMMN:`````
``````:mMMMy-..............:/o-.................................:yo//........-hMMMd-``````
```````.yMMMm+.............:o:++-...............................+y+o-......-+mMMMs.```````
`````````/mMMMd/-...........-++:+/-.---........................-ho+/.....-/dMMMm/`````````
``````````.oNMMMh/............-++:++/////:....................-yo:o-...-+hMMMNo.``````````
````````````.sNMMMdo-...........-++::++:-:/+//:..............:o:/o-..-omMMMNo.````````````
``````````````.omMMMNy+-..........-/+-.:/+/:--:+++/++//:/::/+/-+/.-+hMMMMmo```````````````
`````````````````/hNMMMNho:-...............-:/:-....--::::--..-/ohNMMMNy:`````````````````
```````````````````./hNMMMMmhs/-..........................-/shNMMMMNy/.```````````````````
```````````````````````:sdNMMMMMNdhso+/:----------:/+oshdNMMMMMNho:```````````````````````
``````````````````````````.:+ydNMMMMMMMMMMNNNNNNMMMMMMMMMMmds+:```````````````````````````
````````````````````````````````.:/osyhdmNNMMMMNNmdhyso/:.````````````````````````````````
******************************************************************************************
*                                                                                        *
*                   This logo was graciously delivered by 10003-kun ITT:                 *
*                                                                                        *
*                           http://www.0chan.ru/r/res/9996.html                          *
*                                                                                        *
*****************************************************************************************/
#ifndef _IPC_H_
#define _IPC_H_

/*!
\brief
Переход процесса к ожиданию получения указателя или данных через IPC.

Переход процесса к ожиданию получения указателя или данных через IPC.
Для внутреннего использования.
\param PROC_FLG_IPCW_P - если ждем указатель, либо PROC_FLG_IPCW_D - если ждем данные.
\param указатель на хранилище для передаваемых данных.
*/
void _ipc_wait( flag_t wait_flag, void * ipc_pointer );

/*!
\brief
Переход процесса к ожиданию получения указателя через IPC.

Переход процесса к ожиданию получения указателя через IPC.
\return Указатель.
*/
void * ipc_wait_pointer( void );

/*!
\brief
Переход процесса к ожиданию получения данных через IPC.

Переход процесса к ожиданию получения данных через IPC.
\return Данные.
*/
ipc_data_t ipc_wait_data( void );

/*!
\brief
Посылка указателя процессу через IPC.

Проверяет, действительно ли процесс-адресат ждет получения указателя через IPC.
Если процесс-адресат действительно ждет, Ядро передает указатель и запускает процесс-адресат.
\param указатель на процесс-адресат.
\param указатель для передачи.
\return 1 - если удалось передать указатель, 0 - если нет.
*/
bool_t ipc_send_pointer( proc_t * proc, void * pointer );
/*!
\brief
Посылка данных процессу через IPC.

Проверяет, действительно ли процесс-адресат ждет получения данных через IPC.
Если процесс-адресат действительно ждет, Ядро передает данные и запускает процесс-адресат.
\param указатель на процесс-адресат.
\param данные для передачи.
\return 1 - если удалось передать данные, 0 - если нет.
*/
bool_t ipc_send_data( proc_t * proc, ipc_data_t data );

/*!
\brief
Посылка указателя процессу через IPC. Для вызова из обработчиков прерываний.

\warning Для вызова из обработчиков прерываний!
Проверяет, действительно ли процесс-адресат ждет получения указателя через IPC.
Если процесс-адресат действительно ждет, Ядро передает указатель и запускает процесс-адресат.
\param указатель на процесс-адресат.
\param указатель для передачи.
\return 1 - если удалось передать указатель, 0 - если нет.
*/
bool_t ipc_send_pointer_isr( proc_t * proc, void * pointer );
/*!
\brief
Посылка данных процессу через IPC.Для вызова из обработчиков прерываний.

\warning Для вызова из обработчиков прерываний!
Проверяет, действительно ли процесс-адресат ждет получения данных через IPC.
Если процесс-адресат действительно ждет, Ядро передает данные и запускает процесс-адресат.
\param указатель на процесс-адресат.
\param данные для передачи.
\return 1 - если удалось передать данные, 0 - если нет.
*/
bool_t ipc_send_data_isr( proc_t * proc, ipc_data_t data );

#endif // _IPC_H_
